In [4]:
import pandas as pd

# Example DataFrame
data = {'age': [25, 30, 35, 40],
        'salary': [50000, 60000, 70000, 80000]}
df = pd.DataFrame(data)

# Get descriptive statistics
df.describe()

             age        salary
count   4.000000      4.000000
mean   32.500000  65000.000000
std     6.454972  12909.944487
min    25.000000  50000.000000
25%    28.750000  57500.000000
50%    32.500000  65000.000000
75%    36.250000  72500.000000
max    40.000000  80000.000000

In [5]:
# Basic operations
# df.head(): Displays the first few rows of the DataFrame.
# df.tail(): Displays the last few rows.
# df.shape: Shows the number of rows and columns.
# df.columns: Displays the column names.
# df.describe(): Generates summary statistics for numerical columns.

In [8]:
data = {'age': [25, 30, 35, 40],
        'salary': [50000, 60000, 70000, 80000]}
df = pd.DataFrame(data)
df.head()
#df.head(): Displays the first few rows of the DataFrame.

   age  salary
0   25   50000
1   30   60000
2   35   70000
3   40   80000

In [9]:
df.tail()

   age  salary
0   25   50000
1   30   60000
2   35   70000
3   40   80000

In [11]:
df.shape

(4, 2)

In [15]:
df.columns

Index(['age', 'salary'], dtype='object')

In [16]:
df.describe()

             age        salary
count   4.000000      4.000000
mean   32.500000  65000.000000
std     6.454972  12909.944487
min    25.000000  50000.000000
25%    28.750000  57500.000000
50%    32.500000  65000.000000
75%    36.250000  72500.000000
max    40.000000  80000.000000